{
	"FormatVersion": 2,
	"Namespace": "",
	"Children": [
		{
			"Source":
			{
				"Text": "A true UI pirate never lets a UI sink!\r\n\r\nWrap it in a ScrollBox, like a treasure map stored in a bottle.\r\nDynamically adjust font size—small enough to fit, but not enough to enrage the text gods.\r\nTruncate it with a “More...” button—mystery invites curiosity!"
			},
			"Translation":
			{
				"Text": "A true UI pirate never lets a UI sink!\r\n\r\nWrap it in a ScrollBox, like a treasure map stored in a bottle.\r\nDynamically adjust font size—small enough to fit, but not enough to enrage the text gods.\r\nTruncate it with a “More...” button—mystery invites curiosity!"
			},
			"Key": "BEAF8FD04EEC012707B395AF5332B74E"
		},
		{
			"Source":
			{
				"Text": "Ah! A bold adventurer steps into the unknown! Tell me, are you here for the Trial of the UI Sorcery?"
			},
			"Translation":
			{
				"Text": "Ah! A bold adventurer steps into the unknown! Tell me, are you here for the Trial of the UI Sorcery?"
			},
			"Key": "2F3F704F48BBA7643C478F8132C2C5C0"
		},
		{
			"Source":
			{
				"Text": "Ah, the ancient Hover Glyphs! A challenge worthy of my skills!\r\n\r\nA RichTextBlock! With inline styling to color the enchanted words.\r\nA tooltip system! Hover over \"The Legendary MacGuffin\" and a small scroll of wisdom appears!\r\nStored in a TMap! Linking sacred words to their forbidden knowledge."
			},
			"Translation":
			{
				"Text": "Ah, the ancient Hover Glyphs! A challenge worthy of my skills!\r\n\r\nA RichTextBlock! With inline styling to color the enchanted words.\r\nA tooltip system! Hover over \"The Legendary MacGuffin\" and a small scroll of wisdom appears!\r\nStored in a TMap! Linking sacred words to their forbidden knowledge."
			},
			"Key": "40286ED04360991C7E1FFD8E31EFD741"
		},
		{
			"Source":
			{
				"Text": "By the spirits of Guybrush Threepwood, you’ve passed every trial! You are truly worthy of the title \"Senior UI Programmer!\""
			},
			"Translation":
			{
				"Text": "By the spirits of Guybrush Threepwood, you’ve passed every trial! You are truly worthy of the title \"Senior UI Programmer!\""
			},
			"Key": "A9FEAD684EF5F4D0A61A969847793857"
		},
		{
			"Source":
			{
				"Text": "Does this mean… I get the job?"
			},
			"Translation":
			{
				"Text": "Does this mean… I get the job?"
			},
			"Key": "578B265C4C2A8DE9C23BD8A9A9F67E33"
		},
		{
			"Source":
			{
				"Text": "Gasps! Such mastery!\r\nYou have answered well, brave programmer. But one final test remains…\r\nThe Ultimate UI Trial…\r\nA player clicks rapidly through dialogue. What happens next?"
			},
			"Translation":
			{
				"Text": "Gasps! Such mastery!\r\nYou have answered well, brave programmer. But one final test remains…\r\nThe Ultimate UI Trial…\r\nA player clicks rapidly through dialogue. What happens next?"
			},
			"Key": "508DC48C437E98E193662A847520AC3F"
		},
		{
			"Source":
			{
				"Text": "Ha! Confidence! A fine trait. But can you truly handle the Cursed Dialogue System of the UMG Archipelago?"
			},
			"Translation":
			{
				"Text": "Ha! Confidence! A fine trait. But can you truly handle the Cursed Dialogue System of the UMG Archipelago?"
			},
			"Key": "F1034B6A460A9E97F03FE98DE326F6B9"
		},
		{
			"Source":
			{
				"Text": "Hah! Foolish is the one who hardcodes text in FString!\r\nI shall use FText, not FString, so all words can be translated by the mystical Localization Dashboard.\r\nI shall embrace NSLOCTEXT for every dialogue line!\r\nAnd if fate permits, I shall even prepare JSON imports for future language updates!"
			},
			"Translation":
			{
				"Text": "Hah! Foolish is the one who hardcodes text in FString!\r\nI shall use FText, not FString, so all words can be translated by the mystical Localization Dashboard.\r\nI shall embrace NSLOCTEXT for every dialogue line!\r\nAnd if fate permits, I shall even prepare JSON imports for future language updates!"
			},
			"Key": "711354E648EC135F88A0B8B612DB9472"
		},
		{
			"Source":
			{
				"Text": "Hmm… sharp thinking.\r\nNext! The player wants fancy typewriter effects—text appearing one letter at a time. But they’re impatient and demand a skip feature!"
			},
			"Translation":
			{
				"Text": "Hmm… sharp thinking.\r\nNext! The player wants fancy typewriter effects—text appearing one letter at a time. But they’re impatient and demand a skip feature!"
			},
			"Key": "1070B0944F14DE4A8C677FA0493B2D23"
		},
		{
			"Source":
			{
				"Text": "I have bested sluggish layouts, outwitted memory leaks, and even survived the Great Widget Hierarchy Disaster of ‘23."
			},
			"Translation":
			{
				"Text": "I have bested sluggish layouts, outwitted memory leaks, and even survived the Great Widget Hierarchy Disaster of ‘23."
			},
			"Key": "E3E538E443646F5BDB0479B7B0F928A6"
		},
		{
			"Source":
			{
				"Text": "If by \"UI Sorcery,\" you mean crafting dialogue widgets that dazzle and delight, then yes—I am your pixel-wielding mage."
			},
			"Translation":
			{
				"Text": "If by \"UI Sorcery,\" you mean crafting dialogue widgets that dazzle and delight, then yes—I am your pixel-wielding mage."
			},
			"Key": "027CCD914367B17411CF199E9E3E6538"
		},
		{
			"Source":
			{
				"Text": "Impressive... but let’s test your mettle!\r\nWhat would you do if the dialogue text overflows the sacred boundaries of the widget?"
			},
			"Translation":
			{
				"Text": "Impressive... but let’s test your mettle!\r\nWhat would you do if the dialogue text overflows the sacred boundaries of the widget?"
			},
			"Key": "828BC14E436E78BFAB2F08BCC730F38B"
		},
		{
			"Source":
			{
				"Text": "Indeed roadsman. While the earnest pursuit of material means is good and prosper, one must do so to achieve propsperity for those around him and not for himself.sdf sdf sdf dsf dsf dsf dsf dsf sd Indeed roadsman. While the earnest pursuit of material means is good and prosper, one must do so to achieve propsperity for those around him and not for himself.sdf sdf sdf dsf dsf dsf dsf dsf sd Indeed roadsman. While the earnest pursuit of material means is good and prosper, one must do so to achieve propsperity for those around him and not for himself.sdf sdf sdf dsf dsf dsf dsf dsf sd "
			},
			"Translation":
			{
				"Text": "Indeed roadsman. While the earnest pursuit of material means is good and prosper, one must do so to achieve propsperity for those around him and not for himself.sdf sdf sdf dsf dsf dsf dsf dsf sd Indeed roadsman. While the earnest pursuit of material means is good and prosper, one must do so to achieve propsperity for those around him and not for himself.sdf sdf sdf dsf dsf dsf dsf dsf sd Indeed roadsman. While the earnest pursuit of material means is good and prosper, one must do so to achieve propsperity for those around him and not for himself.sdf sdf sdf dsf dsf dsf dsf dsf sd "
			},
			"Key": "81DB38C749E0C865D674258A47031236"
		},
		{
			"Source":
			{
				"Text": "Narrator"
			},
			"Translation":
			{
				"Text": "Narrator"
			},
			"Key": "6CD84D844F2722D27CCF7CBED0FB8C54"
		},
		{
			"Source":
			{
				"Text": "Nay, it means you get a challenge worthy of your skills. Now, go forth, and build the dialogue system that shall echo through the halls of Unreal Engine 5!"
			},
			"Translation":
			{
				"Text": "Nay, it means you get a challenge worthy of your skills. Now, go forth, and build the dialogue system that shall echo through the halls of Unreal Engine 5!"
			},
			"Key": "BE0B10754C2A6BEC0D8BF5A4CC7A3983"
		},
		{
			"Source":
			{
				"Text": "Nods approvingly.\r\nBut what of the Sacred Words of the Story Keepers? The ones that require special color and mysterious pop-ups when hovered?"
			},
			"Translation":
			{
				"Text": "Nods approvingly.\r\nBut what of the Sacred Words of the Story Keepers? The ones that require special color and mysterious pop-ups when hovered?"
			},
			"Key": "2DD3FE5F4B8558EE9AD3689F94352213"
		},
		{
			"Source":
			{
				"Text": "Programmer"
			},
			"Translation":
			{
				"Text": "Programmer"
			},
			"Key": "7D38AC2E42DE2704DE97318D70273C6A"
		},
		{
			"Source":
			{
				"Text": "Programmer test"
			},
			"Translation":
			{
				"Text": "Programmer test"
			},
			"Key": "D0717D4747CC20FDD30F4A9E86AA0F95"
		},
		{
			"Source":
			{
				"Text": "Recruiter"
			},
			"Translation":
			{
				"Text": "Recruiter"
			},
			"Key": "B915DCDD43F51801352F3198F131FD10"
		},
		{
			"Source":
			{
				"Text": "Scene: The Interview of the Seven UI Trials.\r\nA dimly lit tavern named \"The Blazing Blueprint\" sits at the edge of the digital world. \r\n\r\nThe recruiter, a mysterious figure with a clipboard, awaits the arrival of the Senior UI Programmer. The door creaks open...\r\nSenior UI Programmer (You) enters the room. "
			},
			"Translation":
			{
				"Text": "Scene: The Interview of the Seven UI Trials.\r\nA dimly lit tavern named \"The Blazing Blueprint\" sits at the edge of the digital world. \r\n\r\nThe recruiter, a mysterious figure with a clipboard, awaits the arrival of the Senior UI Programmer. The door creaks open...\r\nSenior UI Programmer (You) enters the room. "
			},
			"Key": "BEB6DFBD4A1B72C51508FCABCCF30B3E"
		},
		{
			"Source":
			{
				"Text": "Senior"
			},
			"Translation":
			{
				"Text": "Senior"
			},
			"Key": "33D1558E43F6B51DA92118B6CE7F2545"
		},
		{
			"Source":
			{
				"Text": "Senior UI Programmer"
			},
			"Translation":
			{
				"Text": "Senior UI Programmer"
			},
			"Key": "F83CD27248F74E02C12A28B42A0B3C0A"
		},
		{
			"Source":
			{
				"Text": "Senior test"
			},
			"Translation":
			{
				"Text": "Senior test"
			},
			"Key": "8536D709496CE3347976F9B1B096634C"
		},
		{
			"Source":
			{
				"Text": "Simple! The typewriter effect shall flow like the tides, but…\r\n\r\nA mere tap of the spacebar shall unleash the mighty SkipText function, revealing all words at once!\r\nAll managed via C++ timers, for only fools trust mere Blueprints alone!"
			},
			"Translation":
			{
				"Text": "Simple! The typewriter effect shall flow like the tides, but…\r\n\r\nA mere tap of the spacebar shall unleash the mighty SkipText function, revealing all words at once!\r\nAll managed via C++ timers, for only fools trust mere Blueprints alone!"
			},
			"Key": "1234654D411F5BF4027E6A91E645CD3E"
		},
		{
			"Source":
			{
				"Text": "The sacred laws demand order!\r\n\r\nEach click shall advance the dialogue naturally.\r\nIf text is still animating, skip the effect first, THEN move to the next line!\r\nA system as smooth as buttered code!"
			},
			"Translation":
			{
				"Text": "The sacred laws demand order!\r\n\r\nEach click shall advance the dialogue naturally.\r\nIf text is still animating, skip the effect first, THEN move to the next line!\r\nA system as smooth as buttered code!"
			},
			"Key": "CC76C568459F80294164BBAFC5DD3A4C"
		},
		{
			"Source":
			{
				"Text": "Thomas Winthrop"
			},
			"Translation":
			{
				"Text": "Thomas Winthrop"
			},
			"Key": "F87122D443AA0280C66FAA8760332315"
		},
		{
			"Source":
			{
				"Text": "UI"
			},
			"Translation":
			{
				"Text": "UI"
			},
			"Key": "CBAA1E8649A87073C492F7911A670D24"
		},
		{
			"Source":
			{
				"Text": "UI test"
			},
			"Translation":
			{
				"Text": "UI test"
			},
			"Key": "16C9B03442010EDB249C13B12614DA60"
		},
		{
			"Source":
			{
				"Text": "UMG"
			},
			"Translation":
			{
				"Text": "UMG"
			},
			"Key": "7920940640553D400A4553A2656CB28A"
		},
		{
			"Source":
			{
				"Text": "UMG test"
			},
			"Translation":
			{
				"Text": "UMG test"
			},
			"Key": "F23F59F94C39FEB18704D9AE679DFF7B"
		},
		{
			"Source":
			{
				"Text": "You are indeed a cunning coder!\r\nBut tell me… what of the Curse of Localization?\r\nIf the King of Text demands translations, will your system break like an overloaded Stack?"
			},
			"Translation":
			{
				"Text": "You are indeed a cunning coder!\r\nBut tell me… what of the Curse of Localization?\r\nIf the King of Text demands translations, will your system break like an overloaded Stack?"
			},
			"Key": "D8E1000F472924D91BA35FA999DDB576"
		}
	]
}